
MOV A,M ;се чита податокот

 OUT 01h ;се праќа мна првиот микропроцесор

 OUT 04h ;се праќа мна вториот микропроцесор

 OUT 16h ;се праќа мна третиот микропроцесор Јамка за 3.2 msec.

 IN 02h ;по 3.2 msec се чита од првиот микропроцесор

 MOV B,A

 IN 08h ;по 3.2 msec се чита од вториот микропроцесор

 CMP B ;се споредува со податокот добиен од I микропроцесор

 JZ OK1 ;исти се!

 JMP CRVENO

 OK1: IN 20h ; се чита податокот од третиот микропроцесор

 CMP B

 JZ OK

CRVENO: MVI A,01XXXXXX ;се праќа „0“ на SOD

 SIM

 JMP KRAJ

 OK: MVI A,11XXXXXX ;се праќа „1“ на SOD

 SIM

 KRAJ: NOP

 END
